
-- Khách Hàng 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------
	
INSERT INTO [dbo].[khach_hang] ([ma], [ten], [sdt], [ngaySinh], [email], [gioiTinh], [cccd], [anh], [matKhau], [vaiTro], [trangThai], [nguoiTao], [nguoiCapNhat], [ngayTao], [ngayCapNhat])
VALUES
	(N'KH001', N'Khách Vãng lai', N'', '', N'', 1, N'', N'', N'', 1, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH002', N'Nguyễn Bá Đăng', N'0987654321', '1995-05-15', N'dang@gmail.com', 0, N'987654321', N'', N'123', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH003', N'Lê Thị Bảo', N'0369852147', '1998-08-20', N'lethi.bao@example.com', 0, N'369852147', N'', N'bao123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH004', N'Nguyễn Văn Cảnh', N'0912345678', '1997-10-25', N'nguyenvan.canh@example.com', 1, N'912345678', N'', N'mkcanh123', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH005', N'Trần Thị Bình', N'0771234567', '1996-12-30', N'tranthi.binh@example.com', 0, N'771234567', N'', N'mkbtran789', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH006', N'Phạm Văn Dũng', N'0987654321', '1994-09-12', N'phamvan.dung@example.com', 1, N'987654321', N'', N'mkdung098', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH007', N'Lê Thị Thơm', N'0369852147', '1995-07-18', N'lethi.thom@example.com', 0, N'369852147', N'', N'thom123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH008', N'Trần Văn Đức', N'0912345678', '1996-04-23', N'tranvan.duc@example.com', 1, N'912345678', N'', N'ductv123', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH009', N'Hoàng Thị Hoa', N'0771234567', '1997-03-10', N'hoangthi.hoa@example.com', 0, N'771234567', N'', N'mkhoahoang', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH010', N'Nguyễn Văn Hùng', N'0987654321', '1998-02-05', N'nguyenvan.hung@example.com', 1, N'987654321', N'', N'mkhung1998', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH011', N'Trần Thị Lan', N'0369852147', '1999-11-28', N'tranthi.lan@example.com', 0, N'369852147', N'', N'tranlan2000', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH012', N'Lê Văn Minh', N'0912345678', '2000-10-15', N'levan.minh@example.com', 1, N'912345678', N'', N'mklevan123', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH013', N'Phạm Thị Nhung', N'0771234567', '2001-09-02', N'phamthi.nhung@example.com', 0, N'771234567', N'', N'nhung123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH014', N'Trần Văn Oanh', N'0987654321', '2002-08-19', N'tranvan.oanh@example.com', 1, N'987654321', N'', N'mkoanh2002', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH015', N'Lê Thị Phương', N'0369852147', '2003-07-06', N'lethi.phuong@example.com', 0, N'369852147', N'', N'phuong123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH016', N'Nguyễn Văn Quân', N'0912345678', '2004-06-23', N'nguyenvan.quan@example.com', 1, N'912345678', N'', N'mkquan2004', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH017', N'Hoàng Thị Rạng', N'0771234567', '2005-05-10', N'hoangthi.rang@example.com', 0, N'771234567', N'', N'rang123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH018', N'Trần Văn Sơn', N'0987654321', '2006-04-27', N'tranvan.son@example.com', 1, N'987654321', N'', N'son123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH019', N'Lê Thị Tâm', N'0369852147', '2007-03-14', N'lethi.tam@example.com', 0, N'369852147', N'', N'tam123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH020', N'Phạm Văn Uyên', N'0912345678', '2008-02-01', N'phamvan.uyen@example.com', 1, N'912345678', N'', N'uyen123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH021', N'Nguyễn Thị Vân', N'0771234567', '2009-01-18', N'nguyenthiv.van@example.com', 0, N'771234567', N'', N'van123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH022', N'Trần Văn Xuân', N'0987654321', '2010-12-06', N'tranvan.xuan@example.com', 1, N'987654321', N'', N'xuan123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH023', N'Lê Thị Yến', N'0369852147', '2011-10-24', N'lethi.yen@example.com', 0, N'369852147', N'', N'yen123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH024', N'Hoàng Văn Zai', N'0912345678', '2012-09-10', N'hoangvan.zai@example.com', 1, N'912345678', N'', N'zai123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH025', N'Trần Thị Mỹ', N'0771234567', '2013-08-28', N'tranthi.my@example.com', 0, N'771234567', N'', N'mythi456', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH026', N'Nguyễn Văn Đạt', N'0987654321', '2014-07-15', N'nguyenvan.dat@example.com', 1, N'987654321', N'', N'dat123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH027', N'Phạm Thị Lan', N'0369852147', '2015-06-02', N'phamthi.lan@example.com', 0, N'369852147', N'', N'lan123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH028', N'Trần Văn Thành', N'0912345678', '2016-05-20', N'tranvan.thanh@example.com', 1, N'912345678', N'', N'thanh123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH029', N'Lê Thị Hương', N'0771234567', '2017-04-07', N'lethi.huong@example.com', 0, N'771234567', N'', N'huong123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01'),
	(N'KH030', N'Nguyễn Văn Phúc', N'0987654321', '2018-03-25', N'nguyenvan.phuc@example.com', 1, N'987654321', N'', N'phuc123mk', 2, 1, N'admin', N'admin', '2024-01-01', '2024-01-01');
	
----------------------------------------------------------------------------------------------------------------------------------------
	


-- Địa chỉ dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

-- Địa chỉ cho khách hàng
INSERT INTO [dbo].[dia_chi] ([idKhachHang], [thanhPho], [quanHuyen], [phuongXa], [soNha], [moTaChiTiet], [tenNguoiNhan], [nguoiTao], [nguoiCapNhat], [ngayTao], [ngayCapNhat], [trangThai])
VALUES
	(2, N'TP Hồ Chí Minh', N'Quận 1', N'Bến Nghé', N'123', N'Nhà số 123, đường Bến Nghé, Quận 1', N'Nguyễn Thị A', N'admin', N'admin', '2024-01-01', '2024-01-01', 1),
	(2, N'TP Hồ Chí Minh', N'Quận 2', N'Thảo Điền', N'456', N'Nhà số 456, đường Thảo Điền, Quận 2', N'Nguyễn Thị A', N'admin', N'admin', '2024-01-01', '2024-01-01', 0),
	(2, N'TP Hồ Chí Minh', N'Quận 3', N'Phú Nhuận', N'789', N'Nhà số 789, đường Phú Nhuận, Quận 3', N'Nguyễn Thị A', N'admin', N'admin', '2024-01-01', '2024-01-01', 0);

-- Địa chỉ cho khách hàng 
INSERT INTO [dbo].[dia_chi] ([idKhachHang], [thanhPho], [quanHuyen], [phuongXa], [soNha], [moTaChiTiet], [tenNguoiNhan], [nguoiTao], [nguoiCapNhat], [ngayTao], [ngayCapNhat], [trangThai])
VALUES
	(3, N'TP Hồ Chí Minh', N'Quận 4', N'Tân Kiểng', N'321', N'Nhà số 321, đường Tân Kiểng, Quận 4', N'Trần Văn B', N'admin', N'admin', '2024-01-01', '2024-01-01', 1),
	(3, N'TP Hồ Chí Minh', N'Quận 5', N'An Hội', N'654', N'Nhà số 654, đường An Hội, Quận 5', N'Trần Văn B', N'admin', N'admin', '2024-01-01', '2024-01-01', 0),
	(3, N'TP Hồ Chí Minh', N'Quận 6', N'Phạm Văn Hai', N'987', N'Nhà số 987, đường Phạm Văn Hai, Quận 6', N'Trần Văn B', N'admin', N'admin' ,'2024-01-01', '2024-01-01', 0)

-- Địa chỉ cho khách hàng
INSERT INTO [dbo].[dia_chi] ([idKhachHang], [thanhPho], [quanHuyen], [phuongXa], [soNha], [moTaChiTiet], [tenNguoiNhan], [nguoiTao], [nguoiCapNhat], [ngayTao], [ngayCapNhat], [trangThai])
VALUES
	(4, N'TP Hồ Chí Minh', N'Quận 7', N'Tân Thuận Đông', N'246', N'Nhà số 246, đường Tân Thuận Đông, Quận 7', N'Nguyễn Văn C', N'admin', N'admin', '2024-01-01', '2024-01-01', 1),
	(4, N'TP Hồ Chí Minh', N'Quận 8', N'Tân Hưng', N'579', N'Nhà số 579, đường Tân Hưng, Quận 8', N'Nguyễn Văn C', N'admin', N'admin', '2024-01-01', '2024-01-01', 0),
	(4, N'TP Hồ Chí Minh', N'Quận 9', N'Phước Long', N'891', N'Nhà số 891, đường Phước Long, Quận 9', N'Nguyễn Văn C', N'admin', N'admin', '2024-01-01', '2024-01-01', 0);

-- Địa chỉ cho khách hàng 
INSERT INTO [dbo].[dia_chi] ([idKhachHang], [thanhPho], [quanHuyen], [phuongXa], [soNha], [moTaChiTiet], [tenNguoiNhan], [nguoiTao], [nguoiCapNhat], [ngayTao], [ngayCapNhat], [trangThai])
VALUES
	(5, N'TP Hồ Chí Minh', N'Quận 10', N'Tân Bình', N'357', N'Nhà số 357, đường Tân Bình, Quận 10', N'Trần Thị D', N'admin', N'admin', '2024-01-01', '2024-01-01', 1),
	(5, N'TP Hồ Chí Minh', N'Quận 11', N'Tân Phú', N'684', N'Nhà số 684, đường Tân Phú, Quận 11', N'Trần Thị D', N'admin', N'admin', '2024-01-01', '2024-01-01', 0),
	(5, N'TP Hồ Chí Minh', N'Quận 12', N'Phước Long', N'987', N'Nhà số 987, đường Phước Long, Quận 12', N'Trần Thị D', N'admin', N'admin', '2024-01-01', '2024-01-01', 0);

-- Địa chỉ cho khách hàng 
INSERT INTO [dbo].[dia_chi] ([idKhachHang], [thanhPho], [quanHuyen], [phuongXa], [soNha], [moTaChiTiet], [tenNguoiNhan], [nguoiTao], [nguoiCapNhat], [ngayTao], [ngayCapNhat], [trangThai])
VALUES
	-- Địa chỉ cho khách hàng
	(6, N'TP Hồ Chí Minh', N'Quận 1', N'Bến Nghé', N'123', N'Nhà số 123, đường Bến Nghé, Quận 1', N'Nguyễn Văn An', N'admin', N'admin', '2024-01-01', '2024-01-01', 1),
	(6, N'TP Hồ Chí Minh', N'Quận 2', N'Thảo Điền', N'456', N'Nhà số 456, đường Thảo Điền, Quận 2', N'Nguyễn Văn An', N'admin', N'admin', '2024-01-01', '2024-01-01', 0),
	(7, N'TP Hồ Chí Minh', N'Quận 3', N'Phú Nhuận', N'789', N'Nhà số 789, đường Phú Nhuận, Quận 3', N'Nguyễn Văn An', N'admin', N'admin', '2024-01-01', '2024-01-01', 0),

	-- Địa chỉ cho khách hàng
	(8, N'TP Hồ Chí Minh', N'Quận 4', N'Tân Kiểng', N'321', N'Nhà số 321, đường Tân Kiểng, Quận 4', N'Trần Văn B', N'admin', N'admin', '2024-01-01', '2024-01-01', 1),
	(9, N'TP Hồ Chí Minh', N'Quận 5', N'An Hội', N'654', N'Nhà số 654, đường An Hội, Quận 5', N'Trần Văn B', N'admin', N'admin', '2024-01-01', '2024-01-01', 0),
	(10, N'TP Hồ Chí Minh', N'Quận 6', N'Phạm Văn Hai', N'987', N'Nhà số 987, đường Phạm Văn Hai, Quận 6', N'Trần Văn B', N'admin', N'admin','2024-01-01', '2024-01-01', 0)

----------------------------------------------------------------------------------------------------------------------------------------



-- Nhân Viên 31 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[nhan_vien] (
    [ma], [ten], [sdt], [ngaySinh], [email], [gioiTinh], 
    [cccd], [anh], [matKhau], [vaiTro], [trangThai], 
    [nguoiTao], [nguoiCapNhat], [ngayTao], [ngayCapNhat], [diaChi]
) VALUES
    ('dungdt', N'Đặng Thị Dung', '0987654331', '1993-04-04', 'dtdung@example.com', 0, 
     '246813579', NULL, 'passwordabc', 0, 1, 
     'admin', 'admin', '2024-01-04 08:00:00', '2024-01-04 08:00:00', N'101 Đường GHI, Quận 4'),
    ('tunglq', N'Lê Quang Tùng', '0987654332', '1994-05-05', 'lqtung@example.com', 1, 
     '357924681', NULL, 'passwordxyz', 1, 1, 
     'admin', 'admin', '2024-01-05 08:00:00', '2024-01-05 08:00:00', N'202 Đường KLM, Quận 5'),
    ('thoph', N'Phan Hữu Thọ', '0987654333', '1995-06-06', 'phtho@example.com', 1, 
     '468135792', NULL, 'password123', 0, 1, 
     'admin', 'admin', '2024-01-06 08:00:00', '2024-01-06 08:00:00', N'303 Đường NOP, Quận 6'),
    ('haihm', N'Mai Hoàng Hải', '0987654334', '1996-07-07', 'mhhai@example.com', 1, 
     '579246813', NULL, 'password456', 0, 1, 
     'admin', 'admin', '2024-01-07 08:00:00', '2024-01-07 08:00:00', N'404 Đường QRS, Quận 7'),
    ('dunglv', N'Lý Văn Dũng', '0987654335', '1997-08-08', 'lvdung@example.com', 1, 
     '681357924', NULL, 'password789', 0, 1, 
     'admin', 'admin', '2024-01-08 08:00:00', '2024-01-08 08:00:00', N'505 Đường TUV, Quận 8'),
    ('daobt', N'Bùi Thị Đào', '0987654336', '1998-09-09', 'btdao@example.com', 0, 
     '792468135', NULL, 'passwordabc', 0, 1, 
     'admin', 'admin', '2024-01-09 08:00:00', '2024-01-09 08:00:00', N'606 Đường WXY, Quận 9'),
    ('anhtn', N'Ngô Thị Anh', '0987654337', '1999-10-10', 'ntanh@example.com', 1, 
     '813579246', NULL, 'passwordxyz', 0, 1, 
     'admin', 'admin', '2024-01-10 08:00:00', '2024-01-10 08:00:00', N'707 Đường ZAB, Quận 10'),
    ('huonglt', N'Lê Thị Hương', '0987654338', '2000-11-11', 'lthuong@example.com', 0, 
     '924681357', NULL, 'password123', 1, 1, 
     'admin', 'admin', '2024-01-11 08:00:00', '2024-01-11 08:00:00', N'808 Đường CDE, Quận 11'),
	 ('tungnv', N'Nguyễn Mạnh Tùng', '0987654340', '2002-01-13', 'nmtung@example.com', 1, 
     '468135792', NULL, 'password789', 1, 1, 
     'admin', 'admin', '2024-01-13 08:00:00', '2024-01-13 08:00:00', N'1010 Đường IJK, Quận Bình Tân'),
    ('chinv', N'Nguyễn Văn Chí', '0987654341', '2003-02-14', 'nvchi@example.com', 1, 
     '579246813', NULL, 'passwordabc', 0, 1, 
     'admin', 'admin', '2024-01-14 08:00:00', '2024-01-14 08:00:00', N'1111 Đường LMN, Quận Bình Chánh'),
    ('hatln', N'Trần Lê Nhật Hà', '0987654342', '2004-03-15', 'tlnha@example.com', 0, 
     '681357924', NULL, 'passwordxyz', 1, 1, 
     'admin', 'admin', '2024-01-15 08:00:00', '2024-01-15 08:00:00', N'1212 Đường OPQ, Quận Gò Vấp'),
    ('ngocph', N'Phạm Huyền Ngọc', '0987654343', '2005-04-16', 'phngoc@example.com', 0, 
     '792468135', NULL, 'password123', 0, 1, 
     'admin', 'admin', '2024-01-16 08:00:00', '2024-01-16 08:00:00', N'1313 Đường RST, Quận Tân Bình'),
    ('binhtn', N'Trần Ngọc Bình', '0987654344', '2006-05-17', 'bntngoc@example.com', 1, 
     '813579246', NULL, 'password456', 1, 1, 
     'admin', 'admin', '2024-01-17 08:00:00', '2024-01-17 08:00:00', N'1414 Đường UVW, Quận Tân Phú'),
    ('trunh', N'Hoàng Thị Trúc Như', '0987654345', '2007-06-18', 'httnhu@example.com', 0, 
     '924681357', NULL, 'password789', 0, 1, 
     'admin', 'admin', '2024-01-18 08:00:00', '2024-01-18 08:00:00', N'1515 Đường XYZ, Quận Thủ Đức'),
    ('lantt', N'Trần Thanh Lân', '0987654346', '2008-07-19', 'ttl@example.com', 1, 
     '135792468', NULL, 'passwordabc', 1, 1, 
     'admin', 'admin', '2024-01-19 08:00:00', '2024-01-19 08:00:00', N'1616 Đường ABC, Quận 1'),
    ('thaopt', N'Phạm Thị Thảo', '0987654347', '2009-08-20', 'thao@example.com', 0, 
     '246813579', NULL, 'passwordxyz', 0, 1, 
     'admin', 'admin', '2024-01-20 08:00:00', '2024-01-20 08:00:00', N'1717 Đường DEF, Quận 2'),
    ('hoanv', N'Vũ Hoàng Anh', '0987654348', '2010-09-21', 'hoan@example.com', 1, 
     '357924681', NULL, 'password123', 1, 1, 
     'admin', 'admin', '2024-01-21 08:00:00', '2024-01-21 08:00:00', N'1818 Đường GHI, Quận 3'),
    ('phungt', N'Trần Văn Phụng', '0987654349', '2011-10-22', 'tvphung@example.com', 1, 
     '468135792', NULL, 'password456', 0, 1, 
     'admin', 'admin', '2024-01-22 08:00:00', '2024-01-22 08:00:00', N'1919 Đường KLM, Quận 4'),
    ('thietk', N'Kiều Thị Thanh Thúy', '0987654350', '2012-11-23', 'kttthuy@example.com', 0, 
     '579246813', NULL, 'password789', 1, 1, 
     'admin', 'admin', '2024-01-23 08:00:00', '2024-01-23 08:00:00', N'2020 Đường NOP, Quận 5'),
    ('binhan', N'Nguyễn Bình An', '0987654351', '2013-12-24', 'nban@example.com', 1, 
     '681357924', NULL, 'passwordabc', 0, 1, 
     'admin', 'admin', '2024-01-24 08:00:00', '2024-01-24 08:00:00', N'2121 Đường QRS, Quận 6'),
    ('khant', N'Trần Văn Khanh', '0987654352', '2014-01-25', 'tvkhanh@example.com', 1, 
     '792468135', NULL, 'passwordxyz', 1, 1, 
     'admin', 'admin', '2024-01-25 08:00:00', '2024-01-25 08:00:00', N'2222 Đường TUV, Quận 7'),
    ('anhpt', N'Phạm Thanh Anh', '0987654353', '2015-02-26', 'pthanh@example.com', 0, 
     '813579246', NULL, 'password123', 0, 1, 
     'admin', 'admin', '2024-01-26 08:00:00', '2024-01-26 08:00:00', N'2323 Đường WXY, Quận 8'),
    ('trungt', N'Trần Minh Trung', '0987654354', '2016-03-27', 'tmtrung@example.com', 1, 
     '924681357', NULL, 'password456', 1, 1, 
     'admin', 'admin', '2024-01-27 08:00:00', '2024-01-27 08:00:00', N'2424 Đường ZAB, Quận 9'),
    ('chauth', N'Hồ Thị Châu', '0987654355', '2017-04-28', 'htchau@example.com', 0, 
     '135792468', NULL, 'password789', 0, 1, 
     'admin', 'admin', '2024-01-28 08:00:00', '2024-01-28 08:00:00', N'2525 Đường CDE, Quận 10'),
    ('ducnt', N'Nguyễn Thanh Đức', '0987654356', '2018-05-29', 'ntduc@example.com', 1, 
     '246813579', NULL, 'passwordabc', 1, 1, 
     'admin', 'admin', '2024-01-29 08:00:00', '2024-01-29 08:00:00', N'2626 Đường FGH, Quận 11'),
    ('dungtv', N'Trần Văn Dũng', '0987654357', '2019-06-30', 'tvdung@example.com', 1, 
     '357924681', NULL, 'passwordxyz', 0, 1, 
     'admin', 'admin', '2024-01-30 08:00:00', '2024-01-30 08:00:00', N'2727 Đường IJK, Quận Bình Tân'),
    ('thanhnq', N'Nguyễn Quang Thành', '0987654358', '2020-07-31', 'nqthanh@example.com', 1, 
     '468135792', NULL, 'password123', 1, 1, 
     'admin', 'admin', '2024-01-31 08:00:00', '2024-01-31 08:00:00', N'2828 Đường LMN, Quận Bình Chánh'),
    ('hangpt', N'Phạm Thị Hằng', '0987654359', '2021-08-01', 'pthang@example.com', 0, 
     '579246813', NULL, 'password456', 0, 1, 
     'admin', 'admin', '2024-02-01 08:00:00', '2024-02-01 08:00:00', N'2929 Đường OPQ, Quận Gò Vấp'),
    ('manhhn', N'Hồ Ngọc Mạnh', '0987654360', '2022-09-02', 'hnmanh@example.com', 1, 
     '681357924', NULL, 'password789', 1, 1, 
     'admin', 'admin', '2024-02-02 08:00:00', '2024-02-02 08:00:00', N'3030 Đường RST, Quận Tân Bình'),
    ('duytk', N'Trần Khắc Duy', '0987654361', '2023-10-03', 'tkduy@example.com', 1, 
     '792468135', NULL, 'passwordabc', 0, 1, 
     'admin', 'admin', '2024-02-03 08:00:00', '2024-02-03 08:00:00', N'3131 Đường UVW, Quận Tân Phú'),
    ('hanglv', N'Lê Thị Hằng', '0987654362', '2024-11-04', 'lthang@example.com', 0, 
     '813579246', NULL, 'passwordxyz', 1, 1, 
     'admin', 'admin', '2024-02-04 08:00:00', '2024-02-04 08:00:00', N'3232 Đường XYZ, Quận Thủ Đức');

----------------------------------------------------------------------------------------------------------------------------------------



-- Phiếu Giảm Giá 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[phieu_giam_gia] (
    [ma], [ten], [soLuong], [hinhThucGiam], [donToiThieu], [giaTriGiam], [giamToiDa], 
    [ngayBatdau], [ngayKetThuc], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [trangThai]
) VALUES
    ('PGG202401', N'Phiếu giảm giá tháng 1', 100, 1, 1000000, 50000, 200000, 
     '2024-01-01 00:00:00', '2024-01-31 23:59:59', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 1, 1, 1),
    ('PGG202402', N'Phiếu giảm giá tháng 2', 150, 0, 800000, 60000, 250000, 
     '2024-02-01 00:00:00', '2024-02-29 23:59:59', '2024-02-01 08:00:00', '2024-02-01 08:00:00', 1, 1, 1),
    ('PGG202403', N'Phiếu giảm giá tháng 3', 120, 1, 1200000, 70000, 300000, 
     '2024-03-01 00:00:00', '2024-03-31 23:59:59', '2024-03-01 08:00:00', '2024-03-01 08:00:00', 1, 1, 1),
    ('PGG202404', N'Phiếu giảm giá tháng 4', 200, 0, 1500000, 80000, 350000, 
     '2024-04-01 00:00:00', '2024-04-30 23:59:59', '2024-04-01 08:00:00', '2024-04-01 08:00:00', 1, 1, 1),
    ('PGG202405', N'Phiếu giảm giá tháng 5', 180, 1, 1100000, 55000, 180000, 
     '2024-05-01 00:00:00', '2024-05-31 23:59:59', '2024-05-01 08:00:00', '2024-05-01 08:00:00', 1, 1, 1),
    ('PGG202406', N'Phiếu giảm giá tháng 6', 160, 0, 1300000, 70000, 250000, 
     '2024-06-01 00:00:00', '2024-06-30 23:59:59', '2024-06-01 08:00:00', '2024-06-01 08:00:00', 1, 1, 1),
    ('PGG202407', N'Phiếu giảm giá tháng 7', 140, 1, 900000, 45000, 150000, 
     '2024-07-01 00:00:00', '2024-07-31 23:59:59', '2024-07-01 08:00:00', '2024-07-01 08:00:00', 1, 1, 1),
    ('PGG202408', N'Phiếu giảm giá tháng 8', 130, 0, 1000000, 60000, 200000, 
     '2024-08-01 00:00:00', '2024-08-31 23:59:59', '2024-08-01 08:00:00', '2024-08-01 08:00:00', 1, 1, 1),
    ('PGG202409', N'Phiếu giảm giá tháng 9', 170, 1, 1400000, 75000, 280000, 
     '2024-09-01 00:00:00', '2024-09-30 23:59:59', '2024-09-01 08:00:00', '2024-09-01 08:00:00', 1, 1, 1),
    ('PGG202410', N'Phiếu giảm giá tháng 10', 190, 0, 1600000, 85000, 300000, 
     '2024-10-01 00:00:00', '2024-10-31 23:59:59', '2024-10-01 08:00:00', '2024-10-01 08:00:00', 1, 1, 1),
    ('PGG202411', N'Phiếu giảm giá tháng 11', 110, 1, 950000, 50000, 170000, 
     '2024-11-01 00:00:00', '2024-11-30 23:59:59', '2024-11-01 08:00:00', '2024-11-01 08:00:00', 1, 1, 1),
    ('PGG202412', N'Phiếu giảm giá tháng 12', 125, 0, 1100000, 60000, 220000, 
     '2024-12-01 00:00:00', '2024-12-31 23:59:59', '2024-12-01 08:00:00', '2024-12-01 08:00:00', 1, 1, 1),
    ('PGG202501', N'Phiếu giảm giá tháng 1/2025', 105, 1, 800000, 40000, 150000, 
     '2025-01-01 00:00:00', '2025-01-31 23:59:59', '2025-01-01 08:00:00', '2025-01-01 08:00:00', 1, 1, 1),
    ('PGG202502', N'Phiếu giảm giá tháng 2/2025', 135, 0, 1200000, 70000, 250000, 
     '2025-02-01 00:00:00', '2025-02-28 23:59:59', '2025-02-01 08:00:00', '2025-02-01 08:00:00', 1, 1, 1),
    ('PGG202503', N'Phiếu giảm giá tháng 3/2025', 115, 1, 900000, 45000, 180000, 
     '2025-03-01 00:00:00', '2025-03-31 23:59:59', '2025-03-01 08:00:00', '2025-03-01 08:00:00', 1, 1, 1),
    ('PGG202504', N'Phiếu giảm giá tháng 4/2025', 155, 0, 1400000, 80000, 300000, 
     '2025-04-01 00:00:00', '2025-04-30 23:59:59', '2025-04-01 08:00:00', '2025-04-01 08:00:00', 1, 1, 1),
    ('PGG202505', N'Phiếu giảm giá tháng 5/2025', 145, 1, 1000000, 50000, 200000, 
     '2025-05-01 00:00:00', '2025-05-31 23:59:59', '2025-05-01 08:00:00', '2025-05-01 08:00:00', 1, 1, 1),
    ('PGG202506', N'Phiếu giảm giá tháng 6/2025', 175, 0, 1600000, 90000, 350000, 
     '2025-06-01 00:00:00', '2025-06-30 23:59:59', '2025-06-01 08:00:00', '2025-06-01 08:00:00', 1, 1, 1),
    ('PGG202507', N'Phiếu giảm giá tháng 7/2025', 195, 1, 1200000, 60000, 250000, 
     '2025-07-01 00:00:00', '2025-07-31 23:59:59', '2025-07-01 08:00:00', '2025-07-01 08:00:00', 1, 1, 1),
    ('PGG202508', N'Phiếu giảm giá tháng 8/2025', 185, 0, 1400000, 70000, 280000, 
     '2025-08-01 00:00:00', '2025-08-31 23:59:59', '2025-08-01 08:00:00', '2025-08-01 08:00:00', 1, 1, 1),
    ('PGG202509', N'Phiếu giảm giá tháng 9/2025', 115, 1, 900000, 40000, 150000, 
     '2025-09-01 00:00:00', '2025-09-30 23:59:59', '2025-09-01 08:00:00', '2025-09-01 08:00:00', 1, 1, 1),
    ('PGG202510', N'Phiếu giảm giá tháng 10/2025', 125, 0, 1000000, 50000, 200000, 
     '2025-10-01 00:00:00', '2025-10-31 23:59:59', '2025-10-01 08:00:00', '2025-10-01 08:00:00', 1, 1, 1),
    ('PGG202511', N'Phiếu giảm giá tháng 11/2025', 165, 1, 1300000, 70000, 300000, 
     '2025-11-01 00:00:00', '2025-11-30 23:59:59', '2025-11-01 08:00:00', '2025-11-01 08:00:00', 1, 1, 1),
    ('PGG202512', N'Phiếu giảm giá tháng 12/2025', 145, 0, 1100000, 60000, 250000, 
     '2025-12-01 00:00:00', '2025-12-31 23:59:59', '2025-12-01 08:00:00', '2025-12-01 08:00:00', 1, 1, 1),
    ('PGG202601', N'Phiếu giảm giá tháng 1/2026', 155, 1, 1200000, 60000, 250000, 
     '2026-01-01 00:00:00', '2026-01-31 23:59:59', '2026-01-01 08:00:00', '2026-01-01 08:00:00', 1, 1, 1),
    ('PGG202602', N'Phiếu giảm giá tháng 2/2026', 185, 0, 1400000, 70000, 280000, 
     '2026-02-01 00:00:00', '2026-02-28 23:59:59', '2026-02-01 08:00:00', '2026-02-01 08:00:00', 1, 1, 1),
    ('PGG202603', N'Phiếu giảm giá tháng 3/2026', 165, 1, 1300000, 65000, 270000, 
     '2026-03-01 00:00:00', '2026-03-31 23:59:59', '2026-03-01 08:00:00', '2026-03-01 08:00:00', 1, 1, 1),
    ('PGG202604', N'Phiếu giảm giá tháng 4/2026', 195, 0, 1500000, 80000, 300000, 
     '2026-04-01 00:00:00', '2026-04-30 23:59:59', '2026-04-01 08:00:00', '2026-04-01 08:00:00', 1, 1, 1),
    ('PGG202605', N'Phiếu giảm giá tháng 5/2026', 175, 1, 1400000, 70000, 280000, 
     '2026-05-01 00:00:00', '2026-05-31 23:59:59', '2026-05-01 08:00:00', '2026-05-01 08:00:00', 1, 1, 1),
    ('PGG202606', N'Phiếu giảm giá tháng 6/2026', 115, 0, 900000, 45000, 150000, 
     '2026-06-01 00:00:00', '2026-06-30 23:59:59', '2026-06-01 08:00:00', '2026-06-01 08:00:00', 1, 1, 1);


----------------------------------------------------------------------------------------------------------------------------------------



-- Ảnh 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------



----------------------------------------------------------------------------------------------------------------------------------------



-- Kích cỡ 19 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[kich_co] (
    [ten], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [trangThai]
) VALUES
    ('35', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 'admin', 'admin', 1),
    ('35.5', '2024-01-02 08:00:00', '2024-01-02 08:00:00', 'admin', 'admin', 1),
    ('36', '2024-01-03 08:00:00', '2024-01-03 08:00:00', 'admin', 'admin', 1),
    ('36.5', '2024-01-04 08:00:00', '2024-01-04 08:00:00', 'admin', 'admin', 1),
    ('37', '2024-01-05 08:00:00', '2024-01-05 08:00:00', 'admin', 'admin', 1),
    ('37.5', '2024-01-06 08:00:00', '2024-01-06 08:00:00', 'admin', 'admin', 1),
    ('38', '2024-01-07 08:00:00', '2024-01-07 08:00:00', 'admin', 'admin', 1),
    ('38.5', '2024-01-08 08:00:00', '2024-01-08 08:00:00', 'admin', 'admin', 1),
    ('39', '2024-01-09 08:00:00', '2024-01-09 08:00:00', 'admin', 'admin', 1),
    ('39.5', '2024-01-10 08:00:00', '2024-01-10 08:00:00', 'admin', 'admin', 1),
    ('40', '2024-01-11 08:00:00', '2024-01-11 08:00:00', 'admin', 'admin', 1),
    ('40.5', '2024-01-12 08:00:00', '2024-01-12 08:00:00', 'admin', 'admin', 1),
    ('41', '2024-01-13 08:00:00', '2024-01-13 08:00:00', 'admin', 'admin', 1),
    ('41.5', '2024-01-14 08:00:00', '2024-01-14 08:00:00', 'admin', 'admin', 1),
    ('42', '2024-01-15 08:00:00', '2024-01-15 08:00:00', 'admin', 'admin', 1),
    ('42.5', '2024-01-16 08:00:00', '2024-01-16 08:00:00', 'admin', 'admin', 1),
    ('43', '2024-01-17 08:00:00', '2024-01-17 08:00:00', 'admin', 'admin', 1),
    ('43.5', '2024-01-18 08:00:00', '2024-01-18 08:00:00', 'admin', 'admin', 1),
    ('44', '2024-01-19 08:00:00', '2024-01-19 08:00:00', 'admin', 'admin', 1);

----------------------------------------------------------------------------------------------------------------------------------------



-- Màu sắc 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[mau_sac] (
    [ten], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [trangThai]
) VALUES
    ('#000000', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 'admin', 'admin', 1), -- Đen
    ('#FFFFFF', '2024-01-02 08:00:00', '2024-01-02 08:00:00', 'admin', 'admin', 1), -- Trắng
    ('#FF0000', '2024-01-03 08:00:00', '2024-01-03 08:00:00', 'admin', 'admin', 1), -- Đỏ
    ('#00FF00', '2024-01-04 08:00:00', '2024-01-04 08:00:00', 'admin', 'admin', 1), -- Xanh lá
    ('#0000FF', '2024-01-05 08:00:00', '2024-01-05 08:00:00', 'admin', 'admin', 1), -- Xanh dương
    ('#FFFF00', '2024-01-06 08:00:00', '2024-01-06 08:00:00', 'admin', 'admin', 1), -- Vàng
    ('#808080', '2024-01-07 08:00:00', '2024-01-07 08:00:00', 'admin', 'admin', 1), -- Xám
    ('#FFC0CB', '2024-01-08 08:00:00', '2024-01-08 08:00:00', 'admin', 'admin', 1), -- Hồng
    ('#FFA500', '2024-01-09 08:00:00', '2024-01-09 08:00:00', 'admin', 'admin', 1), -- Cam
    ('#800080', '2024-01-10 08:00:00', '2024-01-10 08:00:00', 'admin', 'admin', 1), -- Tím
    ('#A52A2A', '2024-01-11 08:00:00', '2024-01-11 08:00:00', 'admin', 'admin', 1), -- Nâu
    ('#008000', '2024-01-12 08:00:00', '2024-01-12 08:00:00', 'admin', 'admin', 1), -- Xanh lá cây
    ('#FFFFE0', '2024-01-13 08:00:00', '2024-01-13 08:00:00', 'admin', 'admin', 1), -- Kem
    ('#FAEBD7', '2024-01-14 08:00:00', '2024-01-14 08:00:00', 'admin', 'admin', 1), -- Màu sữa
    ('#FFD700', '2024-01-15 08:00:00', '2024-01-15 08:00:00', 'admin', 'admin', 1), -- Vàng nổi
    ('#FF6347', '2024-01-16 08:00:00', '2024-01-16 08:00:00', 'admin', 'admin', 1), -- Cam đào
    ('#40E0D0', '2024-01-17 08:00:00', '2024-01-17 08:00:00', 'admin', 'admin', 1), -- Xanh lam
    ('#9370DB', '2024-01-18 08:00:00', '2024-01-18 08:00:00', 'admin', 'admin', 1), -- Tím than
    ('#00FFFF', '2024-01-19 08:00:00', '2024-01-19 08:00:00', 'admin', 'admin', 1), -- Xanh ngọc
    ('#FA8072', '2024-01-20 08:00:00', '2024-01-20 08:00:00', 'admin', 'admin', 1), -- Đỏ thịt
    ('#FFDAB9', '2024-01-21 08:00:00', '2024-01-21 08:00:00', 'admin', 'admin', 1), -- Màu đào
    ('#FFEFD5', '2024-01-22 08:00:00', '2024-01-22 08:00:00', 'admin', 'admin', 1), -- Kem sữa
    ('#E6E6FA', '2024-01-23 08:00:00', '2024-01-23 08:00:00', 'admin', 'admin', 1), -- Màu sắc lavender
    ('#FFA07A', '2024-01-24 08:00:00', '2024-01-24 08:00:00', 'admin', 'admin', 1), -- Đào hồng
    ('#98FB98', '2024-01-25 08:00:00', '2024-01-25 08:00:00', 'admin', 'admin', 1), -- Xanh lá cây mùa xuân
    ('#FF69B4', '2024-01-26 08:00:00', '2024-01-26 08:00:00', 'admin', 'admin', 1), -- Hồng diêm dúa
    ('#FFE4E1', '2024-01-27 08:00:00', '2024-01-27 08:00:00', 'admin', 'admin', 1), -- Gạch nâu nhạt
    ('#B0C4DE', '2024-01-28 08:00:00', '2024-01-28 08:00:00', 'admin', 'admin', 1), -- Xanh dương nhạt
    ('#FF00FF', '2024-01-29 08:00:00', '2024-01-29 08:00:00', 'admin', 'admin', 1), -- Hồng cánh sen
    ('#00FA9A', '2024-01-30 08:00:00', '2024-01-30 08:00:00', 'admin', 'admin', 1); -- Xanh biển
    
----------------------------------------------------------------------------------------------------------------------------------------



-- Cổ giày 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[co_giay] (
    [ten], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [trangThai]
) VALUES
    (N'Giày sneaker', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 'admin', 'admin', 1),
    (N'Giày cao gót', '2024-01-02 08:00:00', '2024-01-02 08:00:00', 'admin', 'admin', 1),
    (N'Giày thể thao', '2024-01-03 08:00:00', '2024-01-03 08:00:00', 'admin', 'admin', 1),
    (N'Giày lười', '2024-01-04 08:00:00', '2024-01-04 08:00:00', 'admin', 'admin', 1),
    (N'Giày búp bê', '2024-01-05 08:00:00', '2024-01-05 08:00:00', 'admin', 'admin', 1),
    (N'Giày sandal', '2024-01-06 08:00:00', '2024-01-06 08:00:00', 'admin', 'admin', 1),
    (N'Giày dép', '2024-01-07 08:00:00', '2024-01-07 08:00:00', 'admin', 'admin', 1),
    (N'Giày chạy bộ', '2024-01-08 08:00:00', '2024-01-08 08:00:00', 'admin', 'admin', 1),
    (N'Giày bóng đá', '2024-01-09 08:00:00', '2024-01-09 08:00:00', 'admin', 'admin', 1),
    (N'Giày đế vuông', '2024-01-10 08:00:00', '2024-01-10 08:00:00', 'admin', 'admin', 1),
    (N'Giày đế bệt', '2024-01-11 08:00:00', '2024-01-11 08:00:00', 'admin', 'admin', 1),
    (N'Giày cổ cao', '2024-01-12 08:00:00', '2024-01-12 08:00:00', 'admin', 'admin', 1),
    (N'Giày cổ thấp', '2024-01-13 08:00:00', '2024-01-13 08:00:00', 'admin', 'admin', 1),
    (N'Giày slip-on', '2024-01-14 08:00:00', '2024-01-14 08:00:00', 'admin', 'admin', 1),
    (N'Giày leo núi', '2024-01-15 08:00:00', '2024-01-15 08:00:00', 'admin', 'admin', 1),
    (N'Giày ông địa', '2024-01-16 08:00:00', '2024-01-16 08:00:00', 'admin', 'admin', 1),
    (N'Giày bảo hộ', '2024-01-17 08:00:00', '2024-01-17 08:00:00', 'admin', 'admin', 1),
    (N'Giày vải', '2024-01-18 08:00:00', '2024-01-18 08:00:00', 'admin', 'admin', 1),
    (N'Giày da', '2024-01-19 08:00:00', '2024-01-19 08:00:00', 'admin', 'admin', 1),
    (N'Giày lụa', '2024-01-20 08:00:00', '2024-01-20 08:00:00', 'admin', 'admin', 1),
    (N'Giày nhựa', '2024-01-21 08:00:00', '2024-01-21 08:00:00', 'admin', 'admin', 1),
    (N'Giày gấu', '2024-01-22 08:00:00', '2024-01-22 08:00:00', 'admin', 'admin', 1),
    (N'Giày thảm', '2024-01-23 08:00:00', '2024-01-23 08:00:00', 'admin', 'admin', 1),
    (N'Giày sợi tre', '2024-01-24 08:00:00', '2024-01-24 08:00:00', 'admin', 'admin', 1),
    (N'Giày kim loại', '2024-01-25 08:00:00', '2024-01-25 08:00:00', 'admin', 'admin', 1),
    (N'Giày bạc', '2024-01-26 08:00:00', '2024-01-26 08:00:00', 'admin', 'admin', 1),
    (N'Giày đồng', '2024-01-27 08:00:00', '2024-01-27 08:00:00', 'admin', 'admin', 1),
    (N'Giày đen', '2024-01-28 08:00:00', '2024-01-28 08:00:00', 'admin', 'admin', 1),
    (N'Giày nâu', '2024-01-29 08:00:00', '2024-01-29 08:00:00', 'admin', 'admin', 1),
    (N'Giày xanh', '2024-01-30 08:00:00', '2024-01-30 08:00:00', 'admin', 'admin', 1);

----------------------------------------------------------------------------------------------------------------------------------------



-- Chất liệu 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[chat_lieu] (
    [ten], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [trangThai]
) VALUES
    (N'Vải', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 'admin', 'admin', 1),
    (N'Đế cao su', '2024-01-02 08:00:00', '2024-01-02 08:00:00', 'admin', 'admin', 1),
    (N'Đế da', '2024-01-03 08:00:00', '2024-01-03 08:00:00', 'admin', 'admin', 1),
    (N'Nhựa', '2024-01-04 08:00:00', '2024-01-04 08:00:00', 'admin', 'admin', 1),
    (N'Gỗ', '2024-01-05 08:00:00', '2024-01-05 08:00:00', 'admin', 'admin', 1),
    (N'Lụa', '2024-01-06 08:00:00', '2024-01-06 08:00:00', 'admin', 'admin', 1),
    (N'Kim loại', '2024-01-07 08:00:00', '2024-01-07 08:00:00', 'admin', 'admin', 1),
    (N'Sợi tre', '2024-01-08 08:00:00', '2024-01-08 08:00:00', 'admin', 'admin', 1),
    (N'Da', '2024-01-09 08:00:00', '2024-01-09 08:00:00', 'admin', 'admin', 1),
    (N'Lông vũ', '2024-01-10 08:00:00', '2024-01-10 08:00:00', 'admin', 'admin', 1),
    (N'Nhung', '2024-01-11 08:00:00', '2024-01-11 08:00:00', 'admin', 'admin', 1),
    (N'Cao su', '2024-01-12 08:00:00', '2024-01-12 08:00:00', 'admin', 'admin', 1),
    (N'Vải dù', '2024-01-13 08:00:00', '2024-01-13 08:00:00', 'admin', 'admin', 1),
    (N'Bố', '2024-01-14 08:00:00', '2024-01-14 08:00:00', 'admin', 'admin', 1),
    (N'Thun', '2024-01-15 08:00:00', '2024-01-15 08:00:00', 'admin', 'admin', 1),
    (N'Linh kiện điện tử', '2024-01-16 08:00:00', '2024-01-16 08:00:00', 'admin', 'admin', 1),
    (N'Đá', '2024-01-17 08:00:00', '2024-01-17 08:00:00', 'admin', 'admin', 1),
    (N'Gốm sứ', '2024-01-18 08:00:00', '2024-01-18 08:00:00', 'admin', 'admin', 1),
    (N'Đá quý', '2024-01-19 08:00:00', '2024-01-19 08:00:00', 'admin', 'admin', 1),
    (N'Ngọc trai', '2024-01-20 08:00:00', '2024-01-20 08:00:00', 'admin', 'admin', 1),
    (N'Vàng', '2024-01-21 08:00:00', '2024-01-21 08:00:00', 'admin', 'admin', 1),
    (N'Bạc', '2024-01-22 08:00:00', '2024-01-22 08:00:00', 'admin', 'admin', 1),
    (N'Kim cương', '2024-01-23 08:00:00', '2024-01-23 08:00:00', 'admin', 'admin', 1),
    (N'Chất liệu tổng hợp', '2024-01-24 08:00:00', '2024-01-24 08:00:00', 'admin', 'admin', 1),
    (N'Si', '2024-01-25 08:00:00', '2024-01-25 08:00:00', 'admin', 'admin', 1),
    (N'Tăm', '2024-01-26 08:00:00', '2024-01-26 08:00:00', 'admin', 'admin', 1),
    (N'Cao cấp', '2024-01-27 08:00:00', '2024-01-27 08:00:00', 'admin', 'admin', 1),
    (N'Bình dân', '2024-01-28 08:00:00', '2024-01-28 08:00:00', 'admin', 'admin', 1),
    (N'Sang trọng', '2024-01-29 08:00:00', '2024-01-29 08:00:00', 'admin', 'admin', 1),
    (N'Thông dụng', '2024-01-30 08:00:00', '2024-01-30 08:00:00', 'admin', 'admin', 1);

----------------------------------------------------------------------------------------------------------------------------------------



-- Nhà sản xuất 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[nha_san_xuat] (
    [ten], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [trangThai]
) VALUES
    (N'Nike', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 'admin', 'admin', 1),
    (N'Adidas', '2024-01-02 08:00:00', '2024-01-02 08:00:00', 'admin', 'admin', 1),
    (N'Puma', '2024-01-03 08:00:00', '2024-01-03 08:00:00', 'admin', 'admin', 1),
    (N'New Balance', '2024-01-04 08:00:00', '2024-01-04 08:00:00', 'admin', 'admin', 1),
    (N'Vans', '2024-01-05 08:00:00', '2024-01-05 08:00:00', 'admin', 'admin', 1),
    (N'Converse', '2024-01-06 08:00:00', '2024-01-06 08:00:00', 'admin', 'admin', 1),
    (N'Under Armour', '2024-01-07 08:00:00', '2024-01-07 08:00:00', 'admin', 'admin', 1),
    (N'Reebok', '2024-01-08 08:00:00', '2024-01-08 08:00:00', 'admin', 'admin', 1),
    (N'Asics', '2024-01-09 08:00:00', '2024-01-09 08:00:00', 'admin', 'admin', 1),
    (N'Fila', '2024-01-10 08:00:00', '2024-01-10 08:00:00', 'admin', 'admin', 1),
    (N'Skechers', '2024-01-11 08:00:00', '2024-01-11 08:00:00', 'admin', 'admin', 1),
    (N'Salomon', '2024-01-12 08:00:00', '2024-01-12 08:00:00', 'admin', 'admin', 1),
    (N'Lacoste', '2024-01-13 08:00:00', '2024-01-13 08:00:00', 'admin', 'admin', 1),
    (N'Polo Ralph Lauren', '2024-01-14 08:00:00', '2024-01-14 08:00:00', 'admin', 'admin', 1),
    (N'Burberry', '2024-01-15 08:00:00', '2024-01-15 08:00:00', 'admin', 'admin', 1),
    (N'Gucci', '2024-01-16 08:00:00', '2024-01-16 08:00:00', 'admin', 'admin', 1),
    (N'Louis Vuitton', '2024-01-17 08:00:00', '2024-01-17 08:00:00', 'admin', 'admin', 1),
    (N'Hermès', '2024-01-18 08:00:00', '2024-01-18 08:00:00', 'admin', 'admin', 1),
    (N'Chanel', '2024-01-19 08:00:00', '2024-01-19 08:00:00', 'admin', 'admin', 1),
    (N'Dior', '2024-01-20 08:00:00', '2024-01-20 08:00:00', 'admin', 'admin', 1),
    (N'Prada', '2024-01-21 08:00:00', '2024-01-21 08:00:00', 'admin', 'admin', 1),
    (N'Balenciaga', '2024-01-22 08:00:00', '2024-01-22 08:00:00', 'admin', 'admin', 1),
    (N'Versace', '2024-01-23 08:00:00', '2024-01-23 08:00:00', 'admin', 'admin', 1),
    (N'Dolce & Gabbana', '2024-01-24 08:00:00', '2024-01-24 08:00:00', 'admin', 'admin', 1),
    (N'Giorgio Armani', '2024-01-25 08:00:00', '2024-01-25 08:00:00', 'admin', 'admin', 1),
    (N'Fendi', '2024-01-26 08:00:00', '2024-01-26 08:00:00', 'admin', 'admin', 1),
    (N'Boss', '2024-01-27 08:00:00', '2024-01-27 08:00:00', 'admin', 'admin', 1),
    (N'Valentino', '2024-01-28 08:00:00', '2024-01-28 08:00:00', 'admin', 'admin', 1),
    (N'Yeezy', '2024-01-29 08:00:00', '2024-01-29 08:00:00', 'admin', 'admin', 1),
    (N'Alexander McQueen', '2024-01-30 08:00:00', '2024-01-30 08:00:00', 'admin', 'admin', 1);

----------------------------------------------------------------------------------------------------------------------------------------



-- Đế giày 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[de_giay] (
    [ten], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [trangThai]
) VALUES
    (N'Commando', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 'admin', 'admin', 1),
    (N'Rubber', '2024-01-02 08:00:00', '2024-01-02 08:00:00', 'admin', 'admin', 1),
    (N'Crepe', '2024-01-03 08:00:00', '2024-01-03 08:00:00', 'admin', 'admin', 1),
    (N'Leather', '2024-01-04 08:00:00', '2024-01-04 08:00:00', 'admin', 'admin', 1),
    (N'Composite', '2024-01-05 08:00:00', '2024-01-05 08:00:00', 'admin', 'admin', 1),
    (N'Wood', '2024-01-06 08:00:00', '2024-01-06 08:00:00', 'admin', 'admin', 1),
    (N'Cork', '2024-01-07 08:00:00', '2024-01-07 08:00:00', 'admin', 'admin', 1),
    (N'Foam', '2024-01-08 08:00:00', '2024-01-08 08:00:00', 'admin', 'admin', 1),
    (N'EVA', '2024-01-09 08:00:00', '2024-01-09 08:00:00', 'admin', 'admin', 1),
    (N'PU', '2024-01-10 08:00:00', '2024-01-10 08:00:00', 'admin', 'admin', 1),
    (N'TPR', '2024-01-11 08:00:00', '2024-01-11 08:00:00', 'admin', 'admin', 1),
    (N'Rubber and Cork', '2024-01-12 08:00:00', '2024-01-12 08:00:00', 'admin', 'admin', 1),
    (N'Gum', '2024-01-13 08:00:00', '2024-01-13 08:00:00', 'admin', 'admin', 1),
    (N'Plastic', '2024-01-14 08:00:00', '2024-01-14 08:00:00', 'admin', 'admin', 1),
    (N'Steel', '2024-01-15 08:00:00', '2024-01-15 08:00:00', 'admin', 'admin', 1),
    (N'Carbon Fiber', '2024-01-16 08:00:00', '2024-01-16 08:00:00', 'admin', 'admin', 1),
    (N'TPU', '2024-01-17 08:00:00', '2024-01-17 08:00:00', 'admin', 'admin', 1),
    (N'Crepe Rubber', '2024-01-18 08:00:00', '2024-01-18 08:00:00', 'admin', 'admin', 1),
    (N'Synthetic', '2024-01-19 08:00:00', '2024-01-19 08:00:00', 'admin', 'admin', 1),
    (N'Vibram', '2024-01-20 08:00:00', '2024-01-20 08:00:00', 'admin', 'admin', 1),
    (N'Crepesole', '2024-01-21 08:00:00', '2024-01-21 08:00:00', 'admin', 'admin', 1),
    (N'Polyurethane', '2024-01-22 08:00:00', '2024-01-22 08:00:00', 'admin', 'admin', 1),
    (N'Air Cushion', '2024-01-23 08:00:00', '2024-01-23 08:00:00', 'admin', 'admin', 1),
    (N'Latex', '2024-01-24 08:00:00', '2024-01-24 08:00:00', 'admin', 'admin', 1),
    (N'Gel', '2024-01-25 08:00:00', '2024-01-25 08:00:00', 'admin', 'admin', 1),
    (N'Sponge', '2024-01-26 08:00:00', '2024-01-26 08:00:00', 'admin', 'admin', 1),
    (N'Rubber and TPU', '2024-01-27 08:00:00', '2024-01-27 08:00:00', 'admin', 'admin', 1),
    (N'Jute', '2024-01-28 08:00:00', '2024-01-28 08:00:00', 'admin', 'admin', 1),
    (N'Leather and Rubber', '2024-01-29 08:00:00', '2024-01-29 08:00:00', 'admin', 'admin', 1),
    (N'Rubber and EVA', '2024-01-30 08:00:00', '2024-01-30 08:00:00', 'admin', 'admin', 1);

----------------------------------------------------------------------------------------------------------------------------------------



-- Thương hiệu 31 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[thuong_hieu] (
    [tenThuongHieu], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [trangThai]
) VALUES
    (N'Nike', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 'admin', 'admin', 1),
    (N'Adidas', '2024-01-02 08:00:00', '2024-01-02 08:00:00', 'admin', 'admin', 1),
    (N'Puma', '2024-01-03 08:00:00', '2024-01-03 08:00:00', 'admin', 'admin', 1),
    (N'New Balance', '2024-01-04 08:00:00', '2024-01-04 08:00:00', 'admin', 'admin', 1),
    (N'Vans', '2024-01-05 08:00:00', '2024-01-05 08:00:00', 'admin', 'admin', 1),
    (N'Converse', '2024-01-06 08:00:00', '2024-01-06 08:00:00', 'admin', 'admin', 1),
    (N'Ralph Lauren', '2024-02-06 08:00:00', '2024-02-06 08:00:00', 'admin', 'admin', 1),
    (N'Marc Jacobs', '2024-02-07 08:00:00', '2024-02-07 08:00:00', 'admin', 'admin', 1),
    (N'Kate Spade', '2024-02-08 08:00:00', '2024-02-08 08:00:00', 'admin', 'admin', 1),
    (N'Burberry', '2024-02-09 08:00:00', '2024-02-09 08:00:00', 'admin', 'admin', 1),
    (N'Coach', '2024-02-10 08:00:00', '2024-02-10 08:00:00', 'admin', 'admin', 1),
    (N'Fossil', '2024-02-11 08:00:00', '2024-02-11 08:00:00', 'admin', 'admin', 1),
    (N'Swarovski', '2024-02-12 08:00:00', '2024-02-12 08:00:00', 'admin', 'admin', 1),
    (N'Guess', '2024-02-13 08:00:00', '2024-02-13 08:00:00', 'admin', 'admin', 1),
    (N'Chloé', '2024-02-14 08:00:00', '2024-02-14 08:00:00', 'admin', 'admin', 1),
    (N'Hugo Boss', '2024-02-15 08:00:00', '2024-02-15 08:00:00', 'admin', 'admin', 1),
    (N'Givenchy', '2024-02-16 08:00:00', '2024-02-16 08:00:00', 'admin', 'admin', 1),
    (N'Kenzo', '2024-02-17 08:00:00', '2024-02-17 08:00:00', 'admin', 'admin', 1),
    (N'Balmain', '2024-02-18 08:00:00', '2024-02-18 08:00:00', 'admin', 'admin', 1),
    (N'Alexander Wang', '2024-02-19 08:00:00', '2024-02-19 08:00:00', 'admin', 'admin', 1),
    (N'Missoni', '2024-02-20 08:00:00', '2024-02-20 08:00:00', 'admin', 'admin', 1),
    (N'Balenciaga', '2024-02-21 08:00:00', '2024-02-21 08:00:00', 'admin', 'admin', 1),
    (N'Giorgio Armani', '2024-02-22 08:00:00', '2024-02-22 08:00:00', 'admin', 'admin', 1),
    (N'Prada', '2024-02-23 08:00:00', '2024-02-23 08:00:00', 'admin', 'admin', 1),
    (N'Gucci', '2024-02-24 08:00:00', '2024-02-24 08:00:00', 'admin', 'admin', 1),
    (N'Louis Vuitton', '2024-02-25 08:00:00', '2024-02-25 08:00:00', 'admin', 'admin', 1),
    (N'Versace', '2024-02-26 08:00:00', '2024-02-26 08:00:00', 'admin', 'admin', 1),
    (N'Chanel', '2024-02-27 08:00:00', '2024-02-27 08:00:00', 'admin', 'admin', 1),
    (N'Hermès', '2024-02-28 08:00:00', '2024-02-28 08:00:00', 'admin', 'admin', 1),
    (N'Fendi', '2024-02-29 08:00:00', '2024-02-29 08:00:00', 'admin', 'admin', 1),
    (N'Burberry', '2024-03-01 08:00:00', '2024-03-01 08:00:00', 'admin', 'admin', 1);

----------------------------------------------------------------------------------------------------------------------------------------



-- Sản phẩm 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[san_pham] (
    [ten], [idThuongHieu], [moTa], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [trangThai]
) VALUES
    (N'Sản phẩm 1', 1, N'Mô tả sản phẩm 1', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 2', 2, N'Mô tả sản phẩm 2', '2024-01-02 08:00:00', '2024-01-02 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 3', 3, N'Mô tả sản phẩm 3', '2024-01-03 08:00:00', '2024-01-03 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 4', 4, N'Mô tả sản phẩm 4', '2024-01-04 08:00:00', '2024-01-04 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 5', 5, N'Mô tả sản phẩm 5', '2024-01-05 08:00:00', '2024-01-05 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 6', 6, N'Mô tả sản phẩm 6', '2024-01-06 08:00:00', '2024-01-06 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 7', 7, N'Mô tả sản phẩm 7', '2024-01-07 08:00:00', '2024-01-07 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 8', 8, N'Mô tả sản phẩm 8', '2024-01-08 08:00:00', '2024-01-08 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 9', 9, N'Mô tả sản phẩm 9', '2024-01-09 08:00:00', '2024-01-09 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 10', 10, N'Mô tả sản phẩm 10', '2024-01-10 08:00:00', '2024-01-10 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 11', 11, N'Mô tả sản phẩm 11', '2024-01-11 08:00:00', '2024-01-11 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 12', 12, N'Mô tả sản phẩm 12', '2024-01-12 08:00:00', '2024-01-12 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 13', 13, N'Mô tả sản phẩm 13', '2024-01-13 08:00:00', '2024-01-13 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 14', 14, N'Mô tả sản phẩm 14', '2024-01-14 08:00:00', '2024-01-14 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 15', 15, N'Mô tả sản phẩm 15', '2024-01-15 08:00:00', '2024-01-15 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 16', 16, N'Mô tả sản phẩm 16', '2024-01-16 08:00:00', '2024-01-16 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 17', 17, N'Mô tả sản phẩm 17', '2024-01-17 08:00:00', '2024-01-17 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 18', 18, N'Mô tả sản phẩm 18', '2024-01-18 08:00:00', '2024-01-18 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 19', 19, N'Mô tả sản phẩm 19', '2024-01-19 08:00:00', '2024-01-19 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 20', 20, N'Mô tả sản phẩm 20', '2024-01-20 08:00:00', '2024-01-20 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 21', 21, N'Mô tả sản phẩm 21', '2024-01-21 08:00:00', '2024-01-21 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 22', 22, N'Mô tả sản phẩm 22', '2024-01-22 08:00:00', '2024-01-22 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 23', 23, N'Mô tả sản phẩm 23', '2024-01-23 08:00:00', '2024-01-23 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 24', 24, N'Mô tả sản phẩm 24', '2024-01-24 08:00:00', '2024-01-24 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 25', 25, N'Mô tả sản phẩm 25', '2024-01-25 08:00:00', '2024-01-25 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 26', 26, N'Mô tả sản phẩm 26', '2024-01-26 08:00:00', '2024-01-26 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 27', 27, N'Mô tả sản phẩm 27', '2024-01-27 08:00:00', '2024-01-27 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 28', 28, N'Mô tả sản phẩm 28', '2024-01-28 08:00:00', '2024-01-28 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 29', 29, N'Mô tả sản phẩm 29', '2024-01-29 08:00:00', '2024-01-29 08:00:00', 'admin', 'admin', 1),
    (N'Sản phẩm 30', 30, N'Mô tả sản phẩm 30', '2024-01-30 08:00:00', '2024-01-30 08:00:00', 'admin', 'admin', 1);

----------------------------------------------------------------------------------------------------------------------------------------


-- Sản phẩm chi tiết 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[san_pham_chi_tiet] 
    ([ma], [ten], [soLuong], [barcode], [giaBan], [moTa], [canNang], [ngaySanXuat], [nguoiTao], [nguoiCapNhat], [ngayTao], [ngayCapNhat], [Anh], [idKichCo], [idMauSac], [idDeGiay], [idChatLieu], [idSanPham], [idCoGiay], [idNhaSanXuat], [trangThai])
VALUES
    (N'MA001', N'Nike Air Max 1', 100, '1234567890101', 800000, N'Mô tả sản phẩm Nike Air Max 1', 400, '2024-01-01 08:00:00', 'admin', 'admin', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 1, 1, 1, 1, 1, 1, 1, 1, 1),
    (N'MA002', N'Adidas Ultraboost 21', 200, '1234567890102', 900000, N'Mô tả sản phẩm Adidas Ultraboost 21', 350, '2024-02-01 08:00:00', 'admin', 'admin', '2024-02-01 08:00:00', '2024-02-01 08:00:00', 2, 2, 2, 2, 2, 2, 2, 2, 1),
    (N'MA003', N'Puma RS-X', 150, '1234567890103', 750000, N'Mô tả sản phẩm Puma RS-X', 300, '2024-03-01 08:00:00', 'admin', 'admin', '2024-03-01 08:00:00', '2024-03-01 08:00:00', 3, 3, 3, 3, 3, 3, 3, 3, 1),
    (N'MA004', N'Reebok Classic', 120, '1234567890104', 700000, N'Mô tả sản phẩm Reebok Classic', 320, '2024-04-01 08:00:00', 'admin', 'admin', '2024-04-01 08:00:00', '2024-04-01 08:00:00', 4, 4, 4, 4, 4, 4, 4, 4, 1),
    (N'MA005', N'New Balance 574', 130, '1234567890105', 680000, N'Mô tả sản phẩm New Balance 574', 310, '2024-05-01 08:00:00', 'admin', 'admin', '2024-05-01 08:00:00', '2024-05-01 08:00:00', 5, 5, 5, 5, 5, 5, 5, 5, 1),
    (N'MA006', N'Asics Gel-Lyte III', 140, '1234567890106', 650000, N'Mô tả sản phẩm Asics Gel-Lyte III', 290, '2024-06-01 08:00:00', 'admin', 'admin', '2024-06-01 08:00:00', '2024-06-01 08:00:00', 6, 6, 6, 6, 6, 6, 6, 6, 1),
    (N'MA007', N'Jordan 1 Retro', 110, '1234567890107', 1000000, N'Mô tả sản phẩm Jordan 1 Retro', 450, '2024-07-01 08:00:00', 'admin', 'admin', '2024-07-01 08:00:00', '2024-07-01 08:00:00', 7, 7, 7, 7, 7, 7, 7, 7, 1),
    (N'MA008', N'Converse Chuck Taylor', 160, '1234567890108', 600000, N'Mô tả sản phẩm Converse Chuck Taylor', 280, '2024-08-01 08:00:00', 'admin', 'admin', '2024-08-01 08:00:00', '2024-08-01 08:00:00', 8, 8, 8, 8, 8, 8, 8, 8, 1),
    (N'MA009', N'Vans Old Skool', 170, '1234567890109', 650000, N'Mô tả sản phẩm Vans Old Skool', 300, '2024-09-01 08:00:00', 'admin', 'admin', '2024-09-01 08:00:00', '2024-09-01 08:00:00', 9, 9, 9, 9, 9, 9, 9, 9, 1),
    (N'MA010', N'Saucony Jazz', 180, '1234567890110', 670000, N'Mô tả sản phẩm Saucony Jazz', 310, '2024-10-01 08:00:00', 'admin', 'admin', '2024-10-01 08:00:00', '2024-10-01 08:00:00', 10, 10, 10, 10, 10, 10, 10, 10, 1),
    (N'MA011', N'Skechers DLites', 190, '1234567890111', 680000, N'Mô tả sản phẩm Skechers DLites', 320, '2024-11-01 08:00:00', 'admin', 'admin', '2024-11-01 08:00:00', '2024-11-01 08:00:00', 11, 11, 11, 11, 11, 11, 11, 11, 1),
    (N'MA012', N'Fila Disruptor', 200, '1234567890112', 690000, N'Mô tả sản phẩm Fila Disruptor', 330, '2024-12-01 08:00:00', 'admin', 'admin', '2024-12-01 08:00:00', '2024-12-01 08:00:00', 12, 12, 12, 12, 12, 12, 12, 12, 1),
    (N'MA013', N'Under Armour HOVR', 210, '1234567890113', 710000, N'Mô tả sản phẩm Under Armour HOVR', 340, '2024-01-01 08:00:00', 'admin', 'admin', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 13, 13, 13, 13, 13, 13, 13, 13, 1),
    (N'MA014', N'Champion 93Eighteen', 220, '1234567890114', 720000, N'Mô tả sản phẩm Champion 93Eighteen', 350, '2024-02-01 08:00:00', 'admin', 'admin', '2024-02-01 08:00:00', '2024-02-01 08:00:00', 14, 14, 14, 14, 14, 14, 14, 14, 1),
    (N'MA015', N'Lacoste Carnaby', 230, '1234567890115', 730000, N'Mô tả sản phẩm Lacoste Carnaby', 360, '2024-03-01 08:00:00', 'admin', 'admin', '2024-03-01 08:00:00', '2024-03-01 08:00:00', 15, 15, 15, 15, 15, 15, 15, 15, 1),
    (N'MA016', N'Le Coq Sportif', 240, '1234567890116', 740000, N'Mô tả sản phẩm Le Coq Sportif', 370, '2024-04-01 08:00:00', 'admin', 'admin', '2024-04-01 08:00:00', '2024-04-01 08:00:00', 16, 16, 16, 16, 16, 16, 16, 16, 1),
    (N'MA017', N'Onitsuka Tiger', 250, '1234567890117', 750000, N'Mô tả sản phẩm Onitsuka Tiger', 380, '2024-05-01 08:00:00', 'admin', 'admin', '2024-05-01 08:00:00', '2024-05-01 08:00:00', 17, 17, 17, 17, 17, 17, 17, 17, 1),
    (N'MA018', N'Hoka One One', 260, '1234567890118', 760000, N'Mô tả sản phẩm Hoka One One', 390, '2024-06-01 08:00:00', 'admin', 'admin', '2024-06-01 08:00:00', '2024-06-01 08:00:00', 18, 18, 18, 18, 18, 18, 18, 18, 1),
    (N'MA019', N'Altra Lone Peak', 270, '1234567890119', 770000, N'Mô tả sản phẩm Altra Lone Peak', 400, '2024-07-01 08:00:00', 'admin', 'admin', '2024-07-01 08:00:00', '2024-07-01 08:00:00', 19, 19, 19, 19, 19, 19, 19, 19, 1),
    (N'MA020', N'Brooks Ghost', 280, '1234567890120', 780000, N'Mô tả sản phẩm Brooks Ghost', 410, '2024-08-01 08:00:00', 'admin', 'admin', '2024-08-01 08:00:00', '2024-08-01 08:00:00', 20, 2, 20, 20, 20, 20, 20, 20, 1),
    (N'MA021', N'K-Swiss Classic', 290, '1234567890121', 790000, N'Mô tả sản phẩm K-Swiss Classic', 420, '2024-09-01 08:00:00', 'admin', 'admin', '2024-09-01 08:00:00', '2024-09-01 08:00:00', 21, 3, 21, 21, 21, 21, 21, 21, 1),
    (N'MA022', N'Timberland 6-Inch', 300, '1234567890122', 800000, N'Mô tả sản phẩm Timberland 6-Inch', 430, '2024-10-01 08:00:00', 'admin', 'admin', '2024-10-01 08:00:00', '2024-10-01 08:00:00', 22, 4, 22, 22, 22, 22, 22, 22, 1),
    (N'MA023', N'Clarks Desert Boot', 310, '1234567890123', 810000, N'Mô tả sản phẩm Clarks Desert Boot', 440, '2024-11-01 08:00:00', 'admin', 'admin', '2024-11-01 08:00:00', '2024-11-01 08:00:00', 23, 5, 23, 23, 23, 23, 23, 23, 1),
    (N'MA024', N'Dr. Martens 1460', 320, '1234567890124', 820000, N'Mô tả sản phẩm Dr. Martens 1460', 450, '2024-12-01 08:00:00', 'admin', 'admin', '2024-12-01 08:00:00', '2024-12-01 08:00:00', 24, 6, 24, 24, 24, 24, 24, 24, 1),
    (N'MA025', N'Birkenstock Arizona', 330, '1234567890125', 830000, N'Mô tả sản phẩm Birkenstock Arizona', 460, '2024-01-01 08:00:00', 'admin', 'admin', '2024-01-01 08:00:00', '2024-01-01 08:00:00', 25, 7, 25, 25, 25, 25, 25, 25, 1),
    (N'MA026', N'Ecco Biom', 340, '1234567890126', 840000, N'Mô tả sản phẩm Ecco Biom', 470, '2024-02-01 08:00:00', 'admin', 'admin', '2024-02-01 08:00:00', '2024-02-01 08:00:00', 26, 8, 26, 26, 26, 26, 26, 26, 1),
    (N'MA027', N'Crocs Classic Clog', 350, '1234567890127', 850000, N'Mô tả sản phẩm Crocs Classic Clog', 480, '2024-03-01 08:00:00', 'admin', 'admin', '2024-03-01 08:00:00', '2024-03-01 08:00:00', 27, 9, 27, 27, 27, 27, 27, 27, 1),
    (N'MA028', N'Toms Alpargata', 360, '1234567890128', 860000, N'Mô tả sản phẩm Toms Alpargata', 490, '2024-04-01 08:00:00', 'admin', 'admin', '2024-04-01 08:00:00', '2024-04-01 08:00:00', 28, 10, 28, 28, 28, 28, 28, 28, 1),
    (N'MA029', N'Ugg Classic Short', 370, '1234567890129', 870000, N'Mô tả sản phẩm Ugg Classic Short', 500, '2024-05-01 08:00:00', 'admin', 'admin', '2024-05-01 08:00:00', '2024-05-01 08:00:00', 29, 11, 29, 29, 29, 29, 29, 29, 1),
    (N'MA030', N'Keen Newport', 380, '1234567890130', 880000, N'Mô tả sản phẩm Keen Newport', 510, '2024-06-01 08:00:00', 'admin', 'admin', '2024-06-01 08:00:00', '2024-06-01 08:00:00', 30, 12, 30, 30, 30, 30, 30, 30, 1);

----------------------------------------------------------------------------------------------------------------------------------------



-- Hóa Đơn 30 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[hoa_don] 
    ([ma], [loai], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [ngayGiaoHang], [ngayThanhToan], [ngayNhan], [tongTien], [tienShip], [tongTienSauGiam], [nguoiNhan], [sdtNguoiNhan], [diaChiNguoiNhan], [ghiChu], [idPhieuGiamGia], [idNhanVien], [idKhachHang], [trangThai])
VALUES
    ('HD001', 1, '2024-07-15', '2024-07-15', 'admin', 'admin', '2024-07-16', '2024-07-17', '2024-07-18', 1000, 50, 950, N'Nguyễn Văn A', '0987654321', N'Ngõ 48 Văn Trì, Minh Khai, Bắc Từ Liêm, Hà Nội', 'Notes for order 1', 1, 1, 1, 6),
    ('HD002', 1, '2024-07-16', '2024-07-16', 'admin', 'admin', '2024-07-17', '2024-07-18', '2024-07-19', 1500, 75, 1425, N'Nguyễn Thị B', '0987654322', N'12 Ngõ Trạm, Hoàn Kiếm, Hà Nội', 'Notes for order 2', 2, 2, 2, 2),
    ('HD003', 1, '2024-07-17', '2024-07-17', 'admin', 'admin', '2024-07-18', '2024-07-19', '2024-07-20', 2000, 100, 1900, N'Nguyễn Văn C', '0987654323', N'15 Giải Phóng, Hai Bà Trưng, Hà Nội', 'Notes for order 3', 3, 3, 3, 3),
    ('HD004', 1, '2024-07-18', '2024-07-18', 'admin', 'admin', '2024-07-19', '2024-07-20', '2024-07-21', 2500, 125, 2375, N'Nguyễn Thị D', '0987654324', N'20 Cầu Giấy, Cầu Giấy, Hà Nội', 'Notes for order 4', 4, 4, 4, 6),
    ('HD005', 1, '2024-07-19', '2024-07-19', 'admin', 'admin', '2024-07-20', '2024-07-21', '2024-07-22', 3000, 150, 2850, N'Nguyễn Văn E', '0987654325', N'25 Nguyễn Chí Thanh, Đống Đa, Hà Nội', 'Notes for order 5', 5, 5, 5, 1),
    ('HD006', 1, '2024-07-20', '2024-07-20', 'admin', 'admin', '2024-07-21', '2024-07-22', '2024-07-23', 3500, 175, 3325, N'Nguyễn Thị F', '0987654326', N'30 Hoàng Diệu, Ba Đình, Hà Nội', 'Notes for order 6', 6, 6, 6, 1),
    ('HD007', 1, '2024-07-21', '2024-07-21', 'admin', 'admin', '2024-07-22', '2024-07-23', '2024-07-24', 4000, 200, 3800, N'Nguyễn Văn G', '0987654327', N'35 Láng Hạ, Đống Đa, Hà Nội', 'Notes for order 7', 7, 7, 7, 1),
    ('HD008', 1, '2024-07-22', '2024-07-22', 'admin', 'admin', '2024-07-23', '2024-07-24', '2024-07-25', 4500, 225, 4275, N'Nguyễn Thị H', '0987654328', N'40 Trần Hưng Đạo, Hoàn Kiếm, Hà Nội', 'Notes for order 8', 7, 8, 8, 1),
    ('HD009', 1, '2024-07-23', '2024-07-23', 'admin', 'admin', '2024-07-24', '2024-07-25', '2024-07-26', 5000, 250, 4750, N'Nguyễn Văn I', '0987654329', N'45 Kim Mã, Ba Đình, Hà Nội', 'Notes for order 9', 8, 9, 9, 1),
    ('HD010', 1, '2024-07-24', '2024-07-24', 'admin', 'admin', '2024-07-25', '2024-07-26', '2024-07-27', 5500, 275, 5225, N'Nguyễn Thị J', '0987654330', N'50 Lê Văn Lương, Thanh Xuân, Hà Nội', 'Notes for order 10', 9, 10, 10, 1),
    ('HD011', 1, '2024-07-25', '2024-07-25', 'admin', 'admin', '2024-07-26', '2024-07-27', '2024-07-28', 6000, 300, 5700, N'Nguyễn Văn K', '0987654331', N'55 Trung Kính, Cầu Giấy, Hà Nội', 'Notes for order 11', 1, 11, 11, 1),
    ('HD012', 1, '2024-07-26', '2024-07-26', 'admin', 'admin', '2024-07-27', '2024-07-28', '2024-07-29', 6500, 325, 6175, N'Nguyễn Thị L', '0987654332', N'60 Xuân Thủy, Cầu Giấy, Hà Nội', 'Notes for order 12', 2, 12, 12, 1),
    ('HD013', 1, '2024-07-27', '2024-07-27', 'admin', 'admin', '2024-07-28', '2024-07-29', '2024-07-30', 7000, 350, 6650, N'Nguyễn Văn M', '0987654333', N'65 Hoàng Hoa Thám, Ba Đình, Hà Nội', 'Notes for order 13', 3, 13, 13, 1),
    ('HD014', 1, '2024-07-28', '2024-07-28', 'admin', 'admin', '2024-07-29', '2024-07-30', '2024-07-31', 7500, 375, 7125, N'Nguyễn Thị N', '0987654334', N'70 Nguyễn Trãi, Thanh Xuân, Hà Nội', 'Notes for order 14', 3, 14, 14, 6),
    ('HD015', 1, '2024-07-29', '2024-07-29', 'admin', 'admin', '2024-07-30', '2024-07-31', '2024-08-01', 8000, 400, 7600, N'Nguyễn Văn O', '0987654335', N'75 Tây Sơn, Đống Đa, Hà Nội', 'Notes for order 15', 4, 15, 15, 1),
    ('HD016', 1, '2024-07-30', '2024-07-30', 'admin', 'admin', '2024-07-31', '2024-08-01', '2024-08-02', 8500, 425, 8075, N'Nguyễn Thị P', '0987654336', N'80 Tôn Đức Thắng, Đống Đa, Hà Nội', 'Notes for order 16', 4, 16, 16, 1),
    ('HD017', 1, '2024-07-31', '2024-07-31', 'admin', 'admin', '2024-08-01', '2024-08-02', '2024-08-03', 9000, 450, 8550, N'Nguyễn Văn Q', '0987654337', N'85 Chùa Bộc, Đống Đa, Hà Nội', 'Notes for order 17', 5, 17, 17, 1),
    ('HD018', 1, '2024-08-01', '2024-08-01', 'admin', 'admin', '2024-08-02', '2024-08-03', '2024-08-04', 9500, 475, 9025, N'Nguyễn Thị R', '0987654338', N'90 Hàng Bài, Hoàn Kiếm, Hà Nội', 'Notes for order 18', 5, 18, 18, 4),
    ('HD019', 1, '2024-08-02', '2024-08-02', 'admin', 'admin', '2024-08-03', '2024-08-04', '2024-08-05', 10000, 500, 9500, N'Nguyễn Văn S', '0987654339', N'95 Hàng Bông, Hoàn Kiếm, Hà Nội', 'Notes for order 19', 6, 19, 19, 1),
    ('HD020', 1, '2024-08-03', '2024-08-03', 'admin', 'admin', '2024-08-04', '2024-08-05', '2024-08-06', 10500, 525, 9975, N'Nguyễn Thị T', '0987654340', N'100 Hàng Cót, Hoàn Kiếm, Hà Nội', 'Notes for order 20', 6, 20, 20, 1),
    ('HD021', 1, '2024-08-04', '2024-08-04', 'admin', 'admin', '2024-08-05', '2024-08-06', '2024-08-07', 11000, 550, 10450, N'Nguyễn Văn U', '0987654341', N'105 Hàng Da, Hoàn Kiếm, Hà Nội', 'Notes for order 21', 7, 21, 21, 3),
    ('HD022', 1, '2024-08-05', '2024-08-05', 'admin', 'admin', '2024-08-06', '2024-08-07', '2024-08-08', 11500, 575, 10925, N'Nguyễn Thị V', '0987654342', N'110 Hàng Gai, Hoàn Kiếm, Hà Nội', 'Notes for order 22', 7, 22, 22, 1),
    ('HD023', 1, '2024-08-06', '2024-08-06', 'admin', 'admin', '2024-08-07', '2024-08-08', '2024-08-09', 12000, 600, 11400, N'Nguyễn Văn W', '0987654343', N'115 Hàng Mã, Hoàn Kiếm, Hà Nội', 'Notes for order 23', 8, 23, 23, 1),
    ('HD024', 1, '2024-08-07', '2024-08-07', 'admin', 'admin', '2024-08-08', '2024-08-09', '2024-08-10', 12500, 625, 11875, N'Nguyễn Thị X', '0987654344', N'120 Hàng Than, Hoàn Kiếm, Hà Nội', 'Notes for order 24', 8, 24, 24, 1),
    ('HD025', 1, '2024-08-08', '2024-08-08', 'admin', 'admin', '2024-08-09', '2024-08-10', '2024-08-11', 13000, 650, 12350, N'Nguyễn Văn Y', '0987654345', N'125 Hàng Tre, Hoàn Kiếm, Hà Nội', 'Notes for order 25', 9, 25, 25, 4),
    ('HD026', 1, '2024-08-09', '2024-08-09', 'admin', 'admin', '2024-08-10', '2024-08-11', '2024-08-12', 13500, 675, 12825, N'Nguyễn Thị Z', '0987654346', N'130 Hàng Vải, Hoàn Kiếm, Hà Nội', 'Notes for order 26', 9, 26, 26, 7),
    ('HD027', 1, '2024-08-10', '2024-08-10', 'admin', 'admin', '2024-08-11', '2024-08-12', '2024-08-13', 14000, 700, 13300, N'Nguyễn Văn AA', '0987654347', N'135 Hàng Muối, Hoàn Kiếm, Hà Nội', 'Notes for order 27', 10, 27, 27, 1),
    ('HD028', 1, '2024-08-11', '2024-08-11', 'admin', 'admin', '2024-08-12', '2024-08-13', '2024-08-14', 14500, 725, 13775, N'Nguyễn Thị BB', '0987654348', N'140 Hàng Điếu, Hoàn Kiếm, Hà Nội', 'Notes for order 28', 10, 28, 28, 4),
    ('HD029', 1, '2024-08-12', '2024-08-12', 'admin', 'admin', '2024-08-13', '2024-08-14', '2024-08-15', 15000, 750, 14250, N'Nguyễn Văn CC', '0987654349', N'145 Hàng Đồng, Hoàn Kiếm, Hà Nội', 'Notes for order 29', 1, 29, 29, 1),
    ('HD030', 1, '2024-08-13', '2024-08-13', 'admin', 'admin', '2024-08-14', '2024-08-15', '2024-08-16', 15500, 775, 14725, N'Nguyễn Thị DD', '0987654350', N'150 Hàng Quạt, Hoàn Kiếm, Hà Nội', 'Notes for order 30', 1, 30, 30, 2);

----------------------------------------------------------------------------------------------------------------------------------------



-- Lịch sử hóa đơn 60 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[lich_su_hoa_don] (
    [idHoaDon], [ghiChu], [nguoiTao], [nguoiCapNhat], [ngayTao], [ngayCapNhat], [hanhDong], [trangThai]
) VALUES
    (1, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-01 08:00:00', '2024-05-01 08:00:00', 1, 1),
    (2, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-02 08:00:00', '2024-05-02 08:00:00', 1, 1),
    (3, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-03 08:00:00', '2024-05-03 08:00:00', 1, 1),
    (4, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-04 08:00:00', '2024-05-04 08:00:00', 1, 1),
    (5, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-05 08:00:00', '2024-05-05 08:00:00', 1, 1),
    (6, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-06 08:00:00', '2024-05-06 08:00:00', 1, 1),
    (7, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-07 08:00:00', '2024-05-07 08:00:00', 1, 1),
    (8, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-08 08:00:00', '2024-05-08 08:00:00', 1, 1),
    (9, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-09 08:00:00', '2024-05-09 08:00:00', 1, 1),
    (10, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-10 08:00:00', '2024-05-10 08:00:00', 1, 1),
    (11, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-11 08:00:00', '2024-05-11 08:00:00', 1, 1),
    (12, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-12 08:00:00', '2024-05-12 08:00:00', 1, 1),
    (13, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-13 08:00:00', '2024-05-13 08:00:00', 1, 1),
    (14, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-14 08:00:00', '2024-05-14 08:00:00', 1, 1),
    (15, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-15 08:00:00', '2024-05-15 08:00:00', 1, 1),
    (16, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-16 08:00:00', '2024-05-16 08:00:00', 1, 1),
    (17, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-17 08:00:00', '2024-05-17 08:00:00', 1, 1),
    (18, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-18 08:00:00', '2024-05-18 08:00:00', 1, 1),
    (19, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-19 08:00:00', '2024-05-19 08:00:00', 1, 1),
    (20, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-20 08:00:00', '2024-05-20 08:00:00', 1, 1),
    (21, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-21 08:00:00', '2024-05-21 08:00:00', 1, 1),
    (22, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-22 08:00:00', '2024-05-22 08:00:00', 1, 1),
    (23, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-23 08:00:00', '2024-05-23 08:00:00', 1, 1),
    (24, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-24 08:00:00', '2024-05-24 08:00:00', 1, 1),
    (25, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-25 08:00:00', '2024-05-25 08:00:00', 1, 1),
    (26, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-26 08:00:00', '2024-05-26 08:00:00', 1, 1),
    (27, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-27 08:00:00', '2024-05-27 08:00:00', 1, 1),
    (28, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-28 08:00:00', '2024-05-28 08:00:00', 1, 1),
    (29, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-29 08:00:00', '2024-05-29 08:00:00', 1, 1),
    (30, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-05-30 08:00:00', '2024-05-30 08:00:00', 1, 1),
	(1, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-01 08:00:00', '2024-06-01 08:00:00', 2, 1),
    (1, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-02 08:00:00', '2024-06-02 08:00:00', 3, 1),
    (1, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-03 08:00:00', '2024-06-03 08:00:00', 4, 1),
    (1, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-04 08:00:00', '2024-06-04 08:00:00', 5, 1),
    (1, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-05 08:00:00', '2024-06-05 08:00:00', 6, 1),
    (2, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-06 08:00:00', '2024-06-06 08:00:00', 2, 1),
    (3, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-07 08:00:00', '2024-06-07 08:00:00', 2, 1),
    (3, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-08 08:00:00', '2024-06-08 08:00:00', 3, 1),
    (4, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-09 08:00:00', '2024-06-09 08:00:00', 2, 1),
    (4, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-10 08:00:00', '2024-06-10 08:00:00', 3, 1),
    (4, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-11 08:00:00', '2024-06-11 08:00:00', 4, 1),
    (4, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-12 08:00:00', '2024-06-12 08:00:00', 5, 1),
    (4, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-13 08:00:00', '2024-06-13 08:00:00', 6, 1),
    (14, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-14 08:00:00', '2024-06-14 08:00:00', 2, 1),
    (14, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-15 08:00:00', '2024-06-15 08:00:00', 3, 1),
    (14, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-16 08:00:00', '2024-06-16 08:00:00', 4, 1),
    (14, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-17 08:00:00', '2024-06-17 08:00:00', 5, 1),
    (18, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-18 08:00:00', '2024-06-18 08:00:00', 2, 1),
    (18, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-19 08:00:00', '2024-06-19 08:00:00', 3, 1),
    (18, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-20 08:00:00', '2024-06-20 08:00:00', 4, 1),
    (21, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-21 08:00:00', '2024-06-21 08:00:00', 2, 1),
    (21, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-22 08:00:00', '2024-06-22 08:00:00', 3, 1),
    (25, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-23 08:00:00', '2024-06-23 08:00:00', 2, 1),
    (25, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-24 08:00:00', '2024-06-24 08:00:00', 3, 1),
    (25, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-25 08:00:00', '2024-06-25 08:00:00', 4, 1),
    (26, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-26 08:00:00', '2024-06-26 08:00:00', 7, 1),
    (28, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-27 08:00:00', '2024-06-27 08:00:00', 2, 1),
    (28, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-28 08:00:00', '2024-06-28 08:00:00', 3, 1),
    (28, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-29 08:00:00', '2024-06-29 08:00:00', 4, 1),
    (30, 'Xác nhận đơn hàng', 'admin', 'admin', '2024-06-30 08:00:00', '2024-06-30 08:00:00', 2, 1);


----------------------------------------------------------------------------------------------------------------------------------------



-- Hóa đơn chi tiết 60 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[hoa_don_chi_tiet] (
    [soLuong], [gia], [idChiTietSanPham], [idHoaDon], [trangThai]
) VALUES
    (2, 500000, 1, 1, 1),
    (1, 800000, 2, 1, 1),
    (3, 1200000, 3, 2, 1),
    (1, 1500000, 4, 2, 1),
    (2, 700000, 5, 3, 1),
    (1, 900000, 6, 3, 1),
    (1, 1100000, 7, 4, 1),
    (2, 600000, 8, 4, 1),
    (3, 1300000, 9, 5, 1),
    (1, 1000000, 10, 5, 1),
    (2, 750000, 11, 6, 1),
    (1, 950000, 12, 6, 1),
    (1, 850000, 13, 7, 1),
    (2, 620000, 14, 7, 1),
    (3, 1150000, 15, 8, 1),
    (1, 1350000, 16, 8, 1),
    (2, 680000, 17, 9, 1),
    (1, 880000, 18, 9, 1),
    (1, 1050000, 19, 10, 1),
    (2, 720000, 20, 10, 1),
    (3, 1250000, 21, 11, 1),
    (1, 980000, 22, 11, 1),
    (2, 770000, 23, 12, 1),
    (1, 920000, 24, 12, 1),
    (1, 800000, 25, 13, 1),
    (2, 640000, 26, 13, 1),
    (3, 1180000, 27, 14, 1),
    (1, 1420000, 28, 14, 1),
    (2, 690000, 29, 15, 1),
    (1, 870000, 30, 15, 1),
    (1, 1070000, 30, 16, 1),
    (2, 730000, 29, 16, 1),
    (3, 1280000, 28, 17, 1),
    (1, 990000, 27, 17, 1),
    (2, 780000, 26, 18, 1),
    (1, 930000, 25, 18, 1),
    (1, 820000, 24, 19, 1),
    (2, 660000, 23, 19, 1),
    (3, 1205000, 22, 20, 1),
    (1, 1480000, 21, 20, 1),
    (2, 710000, 20, 21, 1),
    (1, 860000, 19, 21, 1),
    (1, 1080000, 18, 22, 1),
    (2, 740000, 17, 22, 1),
    (3, 1290000, 16, 23, 1),
    (1, 1005000, 15, 23, 1),
    (2, 790000, 14, 24, 1),
    (1, 940000, 13, 24, 1),
    (1, 830000, 12, 25, 1),
    (2, 670000, 11, 25, 1),
    (3, 1220000, 10, 26, 1),
    (1, 1540000, 9, 26, 1),
    (2, 730000, 8, 27, 1),
    (1, 890000, 7, 27, 1),
    (1, 1100000, 6, 28, 1),
    (2, 760000, 5, 28, 1),
    (3, 1320000, 4, 29, 1),
    (1, 1020000, 3, 29, 1),
    (2, 800000, 2, 30, 1),
    (1, 960000, 1, 30, 1);

----------------------------------------------------------------------------------------------------------------------------------------




-- Phương thức thanh toán 2 dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------

INSERT INTO [dbo].[phuong_thuc_thanh_toan] 
    ([idHoaDon], [tenThanhToan], [loaiThanhToan], [ghiChu], [ngayTao], [ngayCapNhat], [nguoiTao], [nguoiCapNhat], [trangThai]) 
VALUES
    (1, N'Tiền mặt', 1, 'Ghi chú 1', GETDATE(), GETDATE(), 1, 1, 1),
    (2, N'Tiền mặt', 1, 'Ghi chú 2', GETDATE(), GETDATE(), 1, 1, 1),
    (3, N'Tiền mặt', 1, 'Ghi chú 3', GETDATE(), GETDATE(), 1, 1, 1),
    (4, N'Tiền mặt', 1, 'Ghi chú 4', GETDATE(), GETDATE(), 1, 1, 1),
    (5, N'Tiền mặt', 1, 'Ghi chú 5', GETDATE(), GETDATE(), 1, 1, 1),
    (6, N'Tiền mặt', 1, 'Ghi chú 6', GETDATE(), GETDATE(), 1, 1, 1),
    (7, N'Tiền mặt', 1, 'Ghi chú 7', GETDATE(), GETDATE(), 1, 1, 1),
    (8, N'Tiền mặt', 1, 'Ghi chú 8', GETDATE(), GETDATE(), 1, 1, 1),
    (9, N'Tiền mặt', 1, 'Ghi chú 9', GETDATE(), GETDATE(), 1, 1, 1),
    (10, N'Tiền mặt', 1, 'Ghi chú 10', GETDATE(), GETDATE(), 1, 1, 1),
    (11, N'Tiền mặt', 1, 'Ghi chú 11', GETDATE(), GETDATE(), 1, 1, 1),
    (12, N'Tiền mặt', 1, 'Ghi chú 12', GETDATE(), GETDATE(), 1, 1, 1),
    (13, N'Tiền mặt', 1, 'Ghi chú 13', GETDATE(), GETDATE(), 1, 1, 1),
    (14, N'Tiền mặt', 1, 'Ghi chú 14', GETDATE(), GETDATE(), 1, 1, 1),
    (15, N'Tiền mặt', 1, 'Ghi chú 15', GETDATE(), GETDATE(), 1, 1, 1),
    (16, N'Tiền mặt', 1, 'Ghi chú 16', GETDATE(), GETDATE(), 1, 1, 1),
    (17, N'Tiền mặt', 1, 'Ghi chú 17', GETDATE(), GETDATE(), 1, 1, 1),
    (18, N'Tiền mặt', 1, 'Ghi chú 18', GETDATE(), GETDATE(), 1, 1, 1),
    (19, N'Tiền mặt', 1, 'Ghi chú 19', GETDATE(), GETDATE(), 1, 1, 1),
    (20, N'Tiền mặt', 1, 'Ghi chú 20', GETDATE(), GETDATE(), 1, 1, 1),
    (21, N'Tiền mặt', 1, 'Ghi chú 21', GETDATE(), GETDATE(), 1, 1, 1),
    (22, N'Tiền mặt', 1, 'Ghi chú 22', GETDATE(), GETDATE(), 1, 1, 1),
    (23, N'Tiền mặt', 1, 'Ghi chú 23', GETDATE(), GETDATE(), 1, 1, 1),
    (24, N'Tiền mặt', 1, 'Ghi chú 24', GETDATE(), GETDATE(), 1, 1, 1),
    (25, N'Tiền mặt', 1, 'Ghi chú 25', GETDATE(), GETDATE(), 1, 1, 1),
    (26, N'Tiền mặt', 1, 'Ghi chú 26', GETDATE(), GETDATE(), 1, 1, 1),
    (27, N'Tiền mặt', 1, 'Ghi chú 27', GETDATE(), GETDATE(), 1, 1, 1),
    (28, N'Tiền mặt', 1, 'Ghi chú 28', GETDATE(), GETDATE(), 1, 1, 1),
    (29, N'Tiền mặt', 1, 'Ghi chú 29', GETDATE(), GETDATE(), 1, 1, 1),
    (30, N'Tiền mặt', 1, 'Ghi chú 30', GETDATE(), GETDATE(), 1, 1, 1);

----------------------------------------------------------------------------------------------------------------------------------------





-- dữ liệu ----------------------------------------------------------------------------------------------------------------------------------------



----------------------------------------------------------------------------------------------------------------------------------------
